[
    {
        "categoria": "Desarrollo de Software",
        "pregunta": "¿Qué es el desarrollo ágil de software?",
        "respuesta": "Métodos de ingeniería del software basados en el desarrollo iterativo e incremental, donde los requisitos y soluciones evolucionan con el tiempo según la necesidad del proyecto.",
        "incorrecta1": "Un lenguaje de programación ",
        "incorrecta2": "Todas las anteriores ",
        "imagen": "Imagenes\\nivel basico\\pregunta1.png",
        "objectFit": "cover",
        "respuesta_correcta":"Respuesta correcta: ¡Bien allí! Sigue adelante",
        "respuesta_incorrecta":"Respuesta incorrecta: El desarrollo de ágil de software son los métodos de ingeniería del software basados en el desarrollo iterativo e incremental, donde los requisitos y soluciones evolucionan con el tiempo según la necesidad del proyecto. Creo que alguien necesita repasar los conceptos."
    },
    {
        "categoria": "Entretenimiento",
        "pregunta": "¿Qué incluye cada iteración del ciclo de vida del desarrollo ágil?",
        "respuesta": "Involucra el rediseño e implementación de una tarea de la lista de control de proyecto, y el análisis de la versión más reciente del sistema.",
        "incorrecta1": "Un modelo tradicional de cascada",
        "incorrecta2": "Ninguna de las anteriores.",
        "objectFit": "contain",
        "respuesta_correcta":"Respuesta correcta: ¡Excelente!",
        "respuesta_incorrecta":"Respuesta incorrecta: Mmm.... No. Cada interacción del ciclo vida del desarrollo ágil involucra el rediseño e implementación de una tarea de la lista de control de proyecto, y el análisis de la versión más reciente del sistema."
    },
    {
        "categoria": "Entretenimiento",
        "pregunta": "¿Cuál es el objetivo de cada iteración?",
        "respuesta": "Aprender de lo que se ha hecho con anterioridad, sacar ventaja de ello e ir escalando próximas versiones entregables de ese mismo producto.",
        "incorrecta1": "Ninguno",
        "incorrecta2": "Persistir en los errores que hace que el producto no esté completamente prolijo.",
        "imagen": "Imagenes\\nivel basico\\pregunta3.png",
        "respuesta_correcta":"Respuesta correcta: ¡Estas cuchillo!",
        "respuesta_incorrecta":"Respuesta incorrecta: Aguarda un momento mi pequeño(a) saltamontes. El objetivo de cada iteración es aprender de lo que se ha hecho con anterioridad, sacar ventaja de ello e ir escalando próximas versiones entregables de ese mismo producto."
    },
    {
        "categoria": "Entretenimiento",
        "pregunta": "¿Qué debe incluir una oficina de desarrollo ágil?",
        "respuesta": "Un mobiliario que sea de fácil manipulación, dado las necesidades cambiantes de la oficina y requerimiento de adaptabilidad del espacio de trabajo.",
        "incorrecta1": "Un jefe que no logra conectar bien con sus subordinados y, en consecuencia, detoné en un ambiente laboral hostil.",
        "incorrecta2": "El mobiliario, equipos electrónicos e implemento de oficina más onerosos.",
        "objectFit": "cover",
        "respuesta_correcta":"Respuesta correcta: ¡Excelente!",
        "respuesta_incorrecta":"Respuesta incorrecta: Mmm.... No. Cada interacción del ciclo vida del desarrollo ágil involucra el rediseño e implementación de una tarea de la lista de control de proyecto, y el análisis de la versión más reciente del sistema."
    }
]